relational_rails/app/controllers/area_routes_controller.rb

SELECT "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @area = Area.find(params[:area_id])