relational_rails/app/controllers/areas_controller.rb

SELECT "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @area = Area.find(params[:id])