relational_rails/app/controllers/routes_controller.rb

SELECT "routes".* FROM "routes"
---
  def index
    @routes = Route.all

SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @route = Route.find(params[:id])